docs/posts/2023-01-24-updating-the-site.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Updating the Site</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Updating the Site</h1>
<p class="subtitle" role="doc-subtitle">Jan 24, 2023</p>
</header><p>
I&rsquo;ve had trouble getting verified as an educator with GitLab. After getting some notification from them that the &ldquo;ultimate&rdquo; status was being downgraded on my site project (not that it really would have mattered for this, since it&rsquo;s a public repository), I decided to move it to GitHub, where I&rsquo;ve had it before. I had moved it to GitLab because GitLab would do the Hugo build for me after I pushed the updated content to them. In the past, GitHub would build a Jekyll site, but any others needed to be built locally. So, I was pleasantly surprised to see that I could set up a Hugo build on GitHub now. Unfortunately, I couldn&rsquo;t get it to work reliably. What did work exceptionally well is to connect the repository to <a href="https://www.netlify.com">Netlify</a>, and let them handle serving the site. I followed the <a href="https://gohugo.io/hosting-and-deployment/hosting-on-netlify/">instructions</a> in the Hugo documentation, and everything went very smoothly. Netlify automatically detected that the repository was a Hugo site. Their instructions for pointing the domain&rsquo;s name servers to Netlify were clear and simple to follow. It&rsquo;s important to note that the site&rsquo;s theme <i>must</i> be installed as a git submodule. It won&rsquo;t work as a simple git clone. The instructions for most Hugo themes that I see specify installing as a submodule, so you likely already have that done.
</p>

<p>
This seemed to be a good opportunity to update the site&rsquo;s theme. I had started with another theme and rewrote it into my own, but lately I&rsquo;ve been happier letting other people do as much of the configuration work as possible, which explains my move back to <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a>. I picked the <a href="https://github.com/WingLim/hugo-tania">Hugo Tania</a> theme, since it has nice built-in search and tag support.
</p>


<section id="outline-container-orge7b466e" class="outline-2">
<h2 id="orge7b466e">Hugo and Org Mode</h2>
<div class="outline-text-2" id="text-orge7b466e">
<p>
I do most of my writing in Org mode in Emacs. Markdown is the most commonly used simple markup language, and Hugo has always had excellent native support for it. I remember its native support for Org mode to be missing some important things, although I can&rsquo;t really remember what they were. So, I was using <a href="https://ox-hugo.scripter.co">ox-hugo</a> to convert the Org files to Markdown. Evidently, Hugo&rsquo;s parser for Org mode is much more robust than it was, because I haven&rsquo;t had a problem with it parsing native Org files. So, I removed the ox-hugo package and now my posts are written in Org mode and not converted to Markdown. To do so, simply put the Hugo front-matter at the beginning in typical Org fashion. For instance, the front-matter for this post looks like this:
</p>

<div class="org-src-container">
<pre class="src src-org">#+TITLE: Updating the Site
#+draft: false
#+tags[]: hugo emacs org
#+date: 2023-01-24T06:41:27
</pre>
</div>

<p>
Now, that&rsquo;s all that really needs to be done. You can just write posts in Org mode, commit the changes, and push to the repository. Netlify detects that the repository has been changed and rebuilds the site. Of course, since this is Emacs, all of this except the writing can be automated. I modified the scripts that I was using for ox-hugo to make the process simple.
</p>

<p>
First, there is a function that updates the date for the post:
</p>


<div class="org-src-container">
<pre class="src src-elisp">(defun hugo-timestamp ()
  "Update existing date: timestamp on a Hugo post."
  (interactive)
  (save-excursion (
                   goto-char 1)
                  (re-search-forward "^#\\+date:")
                  (let ((beg (point)))
                    (end-of-line)
                    (delete-region beg (point)))
                  (insert (concat " " (format-time-string "%Y-%m-%dT%H:%M:%S")))))
</pre>
</div>

<p>
This sets some variables that are used later. The hugo-post-template variable contains the front-matter items that I generally use. 
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defvar hugo-directory "~/Sites/blog/" "Path to Hugo blog.")
(defvar hugo-posts-dir "content/posts/" "Relative path to posts directory.")
(defvar hugo-post-ext ".org"  "File extension of Hugo posts.")
(defvar hugo-post-template "#+TITLE: \%s\n#+draft: true\n#+tags[]: \n#+date: \n#+mathjax: \n\n"
  "Default template for Hugo posts. %s will be replace by the post title.")
</pre>
</div>

<p>
These are used to generate the file name:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun hugo-make-slug (s) "Turn a string into a slug."
       (replace-regexp-in-string " " "-"  (downcase (replace-regexp-in-string "[^A-Za-z0-9 ]" "" s))))

(defun hugo-yaml-escape (s) "Escape a string for YAML."
       (if (or (string-match ":" s) (string-match "\"" s)) (concat "\"" (replace-regexp-in-string "\"" "\\\\\"" s) "\"") s))
</pre>
</div>

<p>
This creates the file and puts in the front-matter:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun hugo-draft-post (title) "Create a new Hugo blog post."
       (interactive "sPost Title: ")
       (let ((draft-file (concat hugo-directory hugo-posts-dir
                                 (format-time-string "%Y-%m-%d-")
                                 (hugo-make-slug title)
                                 hugo-post-ext)))
         (if (file-exists-p draft-file)
             (find-file draft-file)
           (find-file draft-file)
           (insert (format hugo-post-template (hugo-yaml-escape title)))
           (hugo-timestamp))))
</pre>
</div>

<p>
This sets &ldquo;draft&rdquo; to &ldquo;true&rdquo;, updates the date stamp, and saves the file:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun hugo-publish-post ()
  "Set draft to false and save."
  (interactive)
  (save-excursion (
                   goto-char 1)
                  (re-search-forward "^#\\+draft:")
                  (let ((beg (point)))
                    (end-of-line)
                    (delete-region beg (point)))
                  (insert " false")
                  (hugo-timestamp))
  (save-buffer))
</pre>
</div>


<p>
This commits the changes and pushes them to GitHub, using the current date and time as the commit message:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defmacro with-dir (DIR &amp;rest FORMS)
  "Execute FORMS in DIR."
  (let ((orig-dir (gensym)))
    `(progn (setq ,orig-dir default-directory)
            (cd ,DIR) ,@FORMS (cd ,orig-dir))))

(defun hugo-deploy ()
  "Push changes upstream."
  (interactive)
  (with-dir hugo-directory
            (shell-command "git add .")
            (--&gt; (current-time-string)
                 (concat "git commit -m \"" it "\"")
                 (shell-command it))
            (magit-push-current-to-upstream nil)))
</pre>
</div>

<p>
Finally, set some keybindings to make it all easy.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd "C-c h n") 'hugo-draft-post)
(global-set-key (kbd "C-c h p") 'hugo-publish-post)
(global-set-key (kbd "C-c h t") 'hugo-timestamp)
(global-set-key (kbd "C-c h O") (lambda () (interactive) (find-file "~/Sites/blog/")))
(global-set-key (kbd "C-c h P") (lambda () (interactive) (find-file "~/Sites/blog/content/post/")))
(global-set-key (kbd "C-c h d") 'hugo-deploy)
</pre>
</div>

<p>
I have a few more things to do, like create &ldquo;About&rdquo; and tag pages, and adjust the footnote styling. Unfortunately, I need to get ready for the new semester which begins on Thursday.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
